---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetType
source: html/186ec7c1-9e85-f223-b96a-387e72e77b21.htm
---
# Autodesk.Revit.DB.Visual.AssetType

Enumerated asset types

## Syntax (C#)
```csharp
public enum AssetType
```